In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
#import data
df = pd.read_csv('Salaries/ds_salaries.csv')
print(df.info())
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB
None

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

From the first few rows of data, I can drop the first column as it is duplication of the index. None of the rows have null value, I dont have to perform any imputation.

Next step, I am interested in how many categories included in each column.

In [3]:
df = df.drop(['Unnamed: 0'], axis = 1)

In [6]:
for col in df.columns.to_list():
    if df[col].nunique() < 10 :
        print('Column ' + col + ' has '+ str(df[col].nunique()) +' unique values: ' + str(df[col].unique()))
    else:
        print('Column ' + col + ' has '+ str(df[col].nunique()) +' unique values.')

Column work_year has 3 unique values: [2020 2021 2022]
Column experience_level has 4 unique values: ['MI' 'SE' 'EN' 'EX']
Column employment_type has 4 unique values: ['FT' 'CT' 'PT' 'FL']
Column job_title has 50 unique values.
Column salary has 272 unique values.
Column salary_currency has 17 unique values.
Column salary_in_usd has 369 unique values.
Column employee_residence has 57 unique values.
Column remote_ratio has 3 unique values: [  0  50 100]
Column company_location has 50 unique values.
Column company_size has 3 unique values: ['L' 'S' 'M']

At this point, I can answer some questions regarding this dataset such as this datasets include 3 years of salaries for fulltime, part-time, contract data personels. 

As we already know, salary is propotional with years of experience, also it will increase over the years due to inflation and cost of living. Yada, yada, yada. Anyway, I am applying Linear Regression. 

# First thing first: EDA

Why do we have to do EDA? 
1. Regression model dont like null values. To get rid of null values by either omitting them, imputing with mean or median, or interpolating. 
2. Some models like normal data.